SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_synth.h
/* Bit fields for SYNTH LPFCTRL1TX */
#define _SYNTH_LPFCTRL1TX_RESETVALUE                  0x00000000UL                               /**< Default value for SYNTH_LPFCTRL1TX          */
#define _SYNTH_LPFCTRL1TX_MASK                        0x0003FFFFUL                               /**< Mask for SYNTH_LPFCTRL1TX                   */
#define _SYNTH_LPFCTRL1TX_OP1BWTX_SHIFT               0                                          /**< Shift value for SYNTH_OP1BWTX               */
#define _SYNTH_LPFCTRL1TX_OP1BWTX_MASK                0xFUL                                      /**< Bit mask for SYNTH_OP1BWTX                  */
#define _SYNTH_LPFCTRL1TX_OP1BWTX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1TX           */
#define SYNTH_LPFCTRL1TX_OP1BWTX_DEFAULT              (_SYNTH_LPFCTRL1TX_OP1BWTX_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1TX   */
#define _SYNTH_LPFCTRL1TX_OP1COMPTX_SHIFT             4                                          /**< Shift value for SYNTH_OP1COMPTX             */
#define _SYNTH_LPFCTRL1TX_OP1COMPTX_MASK              0xF0UL                                     /**< Bit mask for SYNTH_OP1COMPTX                */
#define _SYNTH_LPFCTRL1TX_OP1COMPTX_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1TX           */
#define SYNTH_LPFCTRL1TX_OP1COMPTX_DEFAULT            (_SYNTH_LPFCTRL1TX_OP1COMPTX_DEFAULT << 4) /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1TX   */
#define _SYNTH_LPFCTRL1TX_RFBVALTX_SHIFT              8                                          /**< Shift value for SYNTH_RFBVALTX              */
#define _SYNTH_LPFCTRL1TX_RFBVALTX_MASK               0x700UL                                    /**< Bit mask for SYNTH_RFBVALTX                 */
#define _SYNTH_LPFCTRL1TX_RFBVALTX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1TX           */
#define SYNTH_LPFCTRL1TX_RFBVALTX_DEFAULT             (_SYNTH_LPFCTRL1TX_RFBVALTX_DEFAULT << 8)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1TX   */
#define _SYNTH_LPFCTRL1TX_RPVALTX_SHIFT               11                                         /**< Shift value for SYNTH_RPVALTX               */
#define _SYNTH_LPFCTRL1TX_RPVALTX_MASK                0x3800UL                                   /**< Bit mask for SYNTH_RPVALTX                  */
#define _SYNTH_LPFCTRL1TX_RPVALTX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1TX           */
#define SYNTH_LPFCTRL1TX_RPVALTX_DEFAULT              (_SYNTH_LPFCTRL1TX_RPVALTX_DEFAULT << 11)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1TX   */
#define _SYNTH_LPFCTRL1TX_RZVALTX_SHIFT               14                                         /**< Shift value for SYNTH_RZVALTX               */
#define _SYNTH_LPFCTRL1TX_RZVALTX_MASK                0x3C000UL                                  /**< Bit mask for SYNTH_RZVALTX                  */
#define _SYNTH_LPFCTRL1TX_RZVALTX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1TX           */
#define SYNTH_LPFCTRL1TX_RZVALTX_DEFAULT              (_SYNTH_LPFCTRL1TX_RZVALTX_DEFAULT << 14)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1TX   */

/* Bit fields for SYNTH LPFCTRL2RX */
#define _SYNTH_LPFCTRL2RX_RESETVALUE                  0x00000000UL                                  /**< Default value for SYNTH_LPFCTRL2RX          */
#define _SYNTH_LPFCTRL2RX_MASK                        0x1FFFFFFFUL                                  /**< Mask for SYNTH_LPFCTRL2RX                   */
#define SYNTH_LPFCTRL2RX_LPFSWENRX                    (0x1UL << 0)                                  /**< LPF Switching Enable in RX Mode             */
#define _SYNTH_LPFCTRL2RX_LPFSWENRX_SHIFT             0                                             /**< Shift value for SYNTH_LPFSWENRX             */
#define _SYNTH_LPFCTRL2RX_LPFSWENRX_MASK              0x1UL                                         /**< Bit mask for SYNTH_LPFSWENRX                */
#define _SYNTH_LPFCTRL2RX_LPFSWENRX_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_LPFSWENRX_DISABLE           0x00000000UL                                  /**< Mode DISABLE for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_LPFSWENRX_ENABLE            0x00000001UL                                  /**< Mode ENABLE for SYNTH_LPFCTRL2RX            */
#define SYNTH_LPFCTRL2RX_LPFSWENRX_DEFAULT            (_SYNTH_LPFCTRL2RX_LPFSWENRX_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_LPFSWENRX_DISABLE            (_SYNTH_LPFCTRL2RX_LPFSWENRX_DISABLE << 0)    /**< Shifted mode DISABLE for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_LPFSWENRX_ENABLE             (_SYNTH_LPFCTRL2RX_LPFSWENRX_ENABLE << 0)     /**< Shifted mode ENABLE for SYNTH_LPFCTRL2RX    */
#define _SYNTH_LPFCTRL2RX_LPFINCAPRX_SHIFT            1                                             /**< Shift value for SYNTH_LPFINCAPRX            */
#define _SYNTH_LPFCTRL2RX_LPFINCAPRX_MASK             0x6UL                                         /**< Bit mask for SYNTH_LPFINCAPRX               */
#define _SYNTH_LPFCTRL2RX_LPFINCAPRX_DEFAULT          0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define SYNTH_LPFCTRL2RX_LPFINCAPRX_DEFAULT           (_SYNTH_LPFCTRL2RX_LPFINCAPRX_DEFAULT << 1)   /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_LPFGNDSWENRX                 (0x1UL << 3)                                  /**< LPF Gnd Switch Enable in RX Mode            */
#define _SYNTH_LPFCTRL2RX_LPFGNDSWENRX_SHIFT          3                                             /**< Shift value for SYNTH_LPFGNDSWENRX          */
#define _SYNTH_LPFCTRL2RX_LPFGNDSWENRX_MASK           0x8UL                                         /**< Bit mask for SYNTH_LPFGNDSWENRX             */
#define _SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DEFAULT        0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DISABLE        0x00000000UL                                  /**< Mode DISABLE for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_LPFGNDSWENRX_ENABLE         0x00000001UL                                  /**< Mode ENABLE for SYNTH_LPFCTRL2RX            */
#define SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DEFAULT         (_SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DEFAULT << 3) /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DISABLE         (_SYNTH_LPFCTRL2RX_LPFGNDSWENRX_DISABLE << 3) /**< Shifted mode DISABLE for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_LPFGNDSWENRX_ENABLE          (_SYNTH_LPFCTRL2RX_LPFGNDSWENRX_ENABLE << 3)  /**< Shifted mode ENABLE for SYNTH_LPFCTRL2RX    */
#define _SYNTH_LPFCTRL2RX_CALCRX_SHIFT                4                                             /**< Shift value for SYNTH_CALCRX                */
#define _SYNTH_LPFCTRL2RX_CALCRX_MASK                 0x1F0UL                                       /**< Bit mask for SYNTH_CALCRX                   */
#define _SYNTH_LPFCTRL2RX_CALCRX_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define SYNTH_LPFCTRL2RX_CALCRX_DEFAULT               (_SYNTH_LPFCTRL2RX_CALCRX_DEFAULT << 4)       /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CASELRX                      (0x1UL << 9)                                  /**< LPF Ca Select in RX Mode                    */
#define _SYNTH_LPFCTRL2RX_CASELRX_SHIFT               9                                             /**< Shift value for SYNTH_CASELRX               */
#define _SYNTH_LPFCTRL2RX_CASELRX_MASK                0x200UL                                       /**< Bit mask for SYNTH_CASELRX                  */
#define _SYNTH_LPFCTRL2RX_CASELRX_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CASELRX_DISABLE             0x00000000UL                                  /**< Mode DISABLE for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CASELRX_ENABLE              0x00000001UL                                  /**< Mode ENABLE for SYNTH_LPFCTRL2RX            */
#define SYNTH_LPFCTRL2RX_CASELRX_DEFAULT              (_SYNTH_LPFCTRL2RX_CASELRX_DEFAULT << 9)      /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CASELRX_DISABLE              (_SYNTH_LPFCTRL2RX_CASELRX_DISABLE << 9)      /**< Shifted mode DISABLE for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CASELRX_ENABLE               (_SYNTH_LPFCTRL2RX_CASELRX_ENABLE << 9)       /**< Shifted mode ENABLE for SYNTH_LPFCTRL2RX    */
#define _SYNTH_LPFCTRL2RX_CAVALRX_SHIFT               10                                            /**< Shift value for SYNTH_CAVALRX               */
#define _SYNTH_LPFCTRL2RX_CAVALRX_MASK                0x7C00UL                                      /**< Bit mask for SYNTH_CAVALRX                  */
#define _SYNTH_LPFCTRL2RX_CAVALRX_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define SYNTH_LPFCTRL2RX_CAVALRX_DEFAULT              (_SYNTH_LPFCTRL2RX_CAVALRX_DEFAULT << 10)     /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CFBSELRX                     (0x1UL << 15)                                 /**< LPF Cfb Select in RX Mode                   */
#define _SYNTH_LPFCTRL2RX_CFBSELRX_SHIFT              15                                            /**< Shift value for SYNTH_CFBSELRX              */
#define _SYNTH_LPFCTRL2RX_CFBSELRX_MASK               0x8000UL                                      /**< Bit mask for SYNTH_CFBSELRX                 */
#define _SYNTH_LPFCTRL2RX_CFBSELRX_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CFBSELRX_DISABLE            0x00000000UL                                  /**< Mode DISABLE for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CFBSELRX_ENABLE             0x00000001UL                                  /**< Mode ENABLE for SYNTH_LPFCTRL2RX            */
#define SYNTH_LPFCTRL2RX_CFBSELRX_DEFAULT             (_SYNTH_LPFCTRL2RX_CFBSELRX_DEFAULT << 15)    /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CFBSELRX_DISABLE             (_SYNTH_LPFCTRL2RX_CFBSELRX_DISABLE << 15)    /**< Shifted mode DISABLE for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CFBSELRX_ENABLE              (_SYNTH_LPFCTRL2RX_CFBSELRX_ENABLE << 15)     /**< Shifted mode ENABLE for SYNTH_LPFCTRL2RX    */
#define SYNTH_LPFCTRL2RX_CZSELRX                      (0x1UL << 16)                                 /**< LPF Cz Select in RX Mode                    */
#define _SYNTH_LPFCTRL2RX_CZSELRX_SHIFT               16                                            /**< Shift value for SYNTH_CZSELRX               */
#define _SYNTH_LPFCTRL2RX_CZSELRX_MASK                0x10000UL                                     /**< Bit mask for SYNTH_CZSELRX                  */
#define _SYNTH_LPFCTRL2RX_CZSELRX_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CZSELRX_DISABLE             0x00000000UL                                  /**< Mode DISABLE for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_CZSELRX_ENABLE              0x00000001UL                                  /**< Mode ENABLE for SYNTH_LPFCTRL2RX            */
#define SYNTH_LPFCTRL2RX_CZSELRX_DEFAULT              (_SYNTH_LPFCTRL2RX_CZSELRX_DEFAULT << 16)     /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CZSELRX_DISABLE              (_SYNTH_LPFCTRL2RX_CZSELRX_DISABLE << 16)     /**< Shifted mode DISABLE for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_CZSELRX_ENABLE               (_SYNTH_LPFCTRL2RX_CZSELRX_ENABLE << 16)      /**< Shifted mode ENABLE for SYNTH_LPFCTRL2RX    */
#define _SYNTH_LPFCTRL2RX_CZVALRX_SHIFT               17                                            /**< Shift value for SYNTH_CZVALRX               */
#define _SYNTH_LPFCTRL2RX_CZVALRX_MASK                0x1FE0000UL                                   /**< Bit mask for SYNTH_CZVALRX                  */
#define _SYNTH_LPFCTRL2RX_CZVALRX_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define SYNTH_LPFCTRL2RX_CZVALRX_DEFAULT              (_SYNTH_LPFCTRL2RX_CZVALRX_DEFAULT << 17)     /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_MODESELRX                    (0x1UL << 25)                                 /**< LPF Filter Mode Select in RX Mode           */
#define _SYNTH_LPFCTRL2RX_MODESELRX_SHIFT             25                                            /**< Shift value for SYNTH_MODESELRX             */
#define _SYNTH_LPFCTRL2RX_MODESELRX_MASK              0x2000000UL                                   /**< Bit mask for SYNTH_MODESELRX                */
#define _SYNTH_LPFCTRL2RX_MODESELRX_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define _SYNTH_LPFCTRL2RX_MODESELRX_ONEOP             0x00000000UL                                  /**< Mode ONEOP for SYNTH_LPFCTRL2RX             */
#define _SYNTH_LPFCTRL2RX_MODESELRX_TWOOP             0x00000001UL                                  /**< Mode TWOOP for SYNTH_LPFCTRL2RX             */
#define SYNTH_LPFCTRL2RX_MODESELRX_DEFAULT            (_SYNTH_LPFCTRL2RX_MODESELRX_DEFAULT << 25)   /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */
#define SYNTH_LPFCTRL2RX_MODESELRX_ONEOP              (_SYNTH_LPFCTRL2RX_MODESELRX_ONEOP << 25)     /**< Shifted mode ONEOP for SYNTH_LPFCTRL2RX     */
#define SYNTH_LPFCTRL2RX_MODESELRX_TWOOP              (_SYNTH_LPFCTRL2RX_MODESELRX_TWOOP << 25)     /**< Shifted mode TWOOP for SYNTH_LPFCTRL2RX     */
#define _SYNTH_LPFCTRL2RX_VCMLVLRX_SHIFT              26                                            /**< Shift value for SYNTH_VCMLVLRX              */
#define _SYNTH_LPFCTRL2RX_VCMLVLRX_MASK               0x1C000000UL                                  /**< Bit mask for SYNTH_VCMLVLRX                 */
#define _SYNTH_LPFCTRL2RX_VCMLVLRX_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for SYNTH_LPFCTRL2RX           */
#define SYNTH_LPFCTRL2RX_VCMLVLRX_DEFAULT             (_SYNTH_LPFCTRL2RX_VCMLVLRX_DEFAULT << 26)    /**< Shifted mode DEFAULT for SYNTH_LPFCTRL2RX   */

